public class Main {
    public static void main(String[] args) {
        Transliterator transliterator = new Transliterator();
        transliterator.transliterateString("Ехал Грека через реку. Видит Грека в реке рак. Сунул в реку руку Грека. Рак за руку Греку - цап." +
                "Жили-были три китайца: Як, Як-цедрак, Як-цедрак-цедрак-цедрони.\n" +
                "Жили-были три китайки: Цыпа, Цыпа-дрыпа, Цыпа-дрыпа-дрымпампони.\n" +
                "Все они переженились: Як на Цыпе, Як-цедрак на Цыпе-дрыпе,\n" +
                "Як-цедрак-цедрак-цедрони на Цыпе-дрыпе-дрымпампони.\n" +
                "И у них родились дети. У Яка с Цыпой — Шах, у Яка-цедрака с Цыпой-дрыпой — Шах-шарах, у Яка-цедрака-цедрака-цедрони с Цыпой-дрыпой-дрымпампони — Шах-шарах-шарах-широни.");
    }
}
